MESH INDEP/peh_base_case_m3_2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


Ubar            Ubar [0 1 -1 0 0 0 0] (0.7210 0 0); // Ubar is the volume averaged velocity. To convert to the bulk velocity at the inlet patch divide Ubar by 0.7210  Ubar should then be 0.020188

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1.785714e-04;


// ************************************************************************* //
