MESH INDEP/peh_base_case_m3_2D/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 89.35651725309215;

boundaryField
{
    
	"(inlet|outlet)"
    {
        type            cyclic;
    }
	"(front|back)"
	{
		type empty;
	}
    "(top|hills)"
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
